<a href="https://colab.research.google.com/github/SandeshRangreji/AIML-Workshop/blob/main/Session%203/Pandas_AIML_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Importing Libraries**

In [ ]:
import numpy as np
import pandas as pd

Preparing Dataframe

In [ ]:
names = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']
marks = [87, 89, 86, 32, 43, 45, 80, 10, 90, 31]
cities = ['Bengaluru', 'Delhi', 'Mumbai', 'Bengaluru', 'Delhi', 'Mumbai', 'Bengaluru', 'Delhi', 'Mumbai', 'Delhi']

data = {
    'name' : names,
    'marks': marks,
    'city': cities
}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

  name  marks       city
0    A     87  Bengaluru
1    B     89      Delhi
2    C     86     Mumbai
3    D     32  Bengaluru
4    E     43      Delhi
5    F     45     Mumbai
6    G     80  Bengaluru
7    H     10      Delhi
8    I     90     Mumbai
9    J     31      Delhi

Operations on a dataframe

In [ ]:

df.shape

(10, 3)

In [ ]:
df.size

30

In [ ]:
df.head()

  name  marks       city
0    A     87  Bengaluru
1    B     89      Delhi
2    C     86     Mumbai
3    D     32  Bengaluru
4    E     43      Delhi

In [ ]:
df.head(2)

  name  marks       city
0    A     87  Bengaluru
1    B     89      Delhi

In [ ]:
df.tail()

  name  marks       city
5    F     45     Mumbai
6    G     80  Bengaluru
7    H     10      Delhi
8    I     90     Mumbai
9    J     31      Delhi

In [ ]:
df.tail(2)

  name  marks    city
8    I     90  Mumbai
9    J     31   Delhi

In [ ]:
df['name']

0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    H
8    I
9    J
Name: name, dtype: object

In [ ]:
print("Name : ", df['name'][0])
print("Marks : ", df['marks'][0])
print("City : ", df['city'][0])

Name :  A
Marks :  87
City :  Bengaluru

In [ ]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [ ]:
df.columns

Index(['name', 'marks', 'city'], dtype='object')

In [ ]:
df.columns = ['name_x', 'marks_x', 'city_x']

In [ ]:
df.head()

  name_x  marks_x     city_x
0      A       87  Bengaluru
1      B       89      Delhi
2      C       86     Mumbai
3      D       32  Bengaluru
4      E       43      Delhi

In [ ]:
df['name_x'][0] = 'Q'

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df.head()

  name_x  marks_x     city_x
0      Q       87  Bengaluru
1      B       89      Delhi
2      C       86     Mumbai
3      D       32  Bengaluru
4      E       43      Delhi

In [ ]:
df.name_x[0] = 'W'

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df.head()

  name_x  marks_x     city_x
0      W       87  Bengaluru
1      B       89      Delhi
2      C       86     Mumbai
3      D       32  Bengaluru
4      E       43      Delhi

In [ ]:
df.loc[0, 'name_x'] = 'Z'

In [ ]:
df.head()

  name_x  marks_x     city_x
0      Z       87  Bengaluru
1      B       89      Delhi
2      C       86     Mumbai
3      D       32  Bengaluru
4      E       43      Delhi

In [ ]:
df.drop('city_x', axis = 1) # axis = 1 is for column, returns a new dataset and the original dataset remains unchanged. That is, it is not inplace!

  name_x  marks_x
0      Z       87
1      B       89
2      C       86
3      D       32
4      E       43
5      F       45
6      G       80
7      H       10
8      I       90
9      J       31

In [ ]:
df1 = df.drop(1, axis = 0, inplace = False) 
# axis = 0 is for row, returns a new dataset and the original dataset remains unchanged.
# inpace = False by default, inpace = True will make changes in the original dataset

In [ ]:
df1

  name_x  marks_x     city_x
0      Z       87  Bengaluru
2      C       86     Mumbai
3      D       32  Bengaluru
4      E       43      Delhi
5      F       45     Mumbai
6      G       80  Bengaluru
7      H       10      Delhi
8      I       90     Mumbai
9      J       31      Delhi

In [ ]:
df.head()

  name_x  marks_x     city_x
0      Z       87  Bengaluru
1      B       89      Delhi
2      C       86     Mumbai
3      D       32  Bengaluru
4      E       43      Delhi

In [ ]:
df.loc[[1,2], ['name_x', 'marks_x']]

  name_x  marks_x
1      B       89
2      C       86

In [ ]:
df1.loc[1,2] # Throws error because key '1' is not present in the df1 dataframe.

KeyError: ignored

In [ ]:
df1.iloc[1,2]

'Mumbai'

In [ ]:
df.loc[:, ['name_x']]

  name_x
0      Z
1      B
2      C
3      D
4      E
5      F
6      G
7      H
8      I
9      J

In [ ]:
df.loc[[2,5], :]

  name_x  marks_x  city_x
2      C       86  Mumbai
5      F       45  Mumbai

In [ ]:
df.iloc[1,2] # 1 is index for row and 2 is index for column

'Delhi'

In [ ]:
df['name_x'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: name_x, dtype: bool

In [ ]:
sum(df['name_x'].isnull())

0